import React from 'react';
import { Card, Container } from 'react-bootstrap';

const HomePage = () => {
    return (
        <Container
            className='d-flex flex-column align-items-center mt-3'
        >
            <Card className='p-5'>
                <h2>Відомості про студента</h2>
                <p><strong>ПІБ:</strong> Шафранов Віктор Дмитрович</p>
                <p><strong>Група:</strong> ІС-21 </p>
                <h3>Предметна область: Облік пасажирів в аеропорту</h3>
                <p style={{'textAlign': 'justify'}}>
                    У аеропорту існує два термінали: термінал А для внутрішніх рейсів і термінал Б –
                    для міжнародних. Пасажир прибуває до аеропорту і стає на реєстрацію до відповідного
                    терміналу. При реєстрації перевіряються документи і авіаквиток пасажира, при
                    міжнародному перельоті додатково перевіряється віза пасажира. Під час реєстрації
                    додатково перевіряється, чи не є пасажир у внутрішньому або міжнародному (Інтерпол)
                    розшуку, при необхідності інформуються відповідні органи.
                </p>
                <p style={{'textAlign': 'justify'}}>
                    В разі вдалої реєстрації відбувається оформлення і перевірка багажу. Якщо об'єм
                    або вага багажу пасажира перевищує припустимі норми, то виписується квитанція на
                    додаткову оплату перевезення.
                </p>
                <p style={{'textAlign': 'justify'}}>
                    За 10 хвилин до відправки рейса реєстрація пасажирів припиняється, формується
                    остаточний список пасажирів і багажу. На підставі сформованих списків власники
                    авіакомпаній приймають рішення про скорочення або збільшення числа рейсів:
                </p>
                <ul>
                    <li style={{'textAlign': 'justify'}}>
                        якщо кількість пасажирів постійно менше заданої кількості, потрібної для
                        рентабельності рейсу, то приймається рішення по скороченню кількості
                        рейсів;
                    </li>
                    <li style={{'textAlign': 'justify'}}>
                        якщо літак майже завжди завантажений на 95%, то розглядається варіант
                        по збільшенню кількості рейсів у даному напрямі.
                    </li>
                </ul>
            </Card>
        </Container>
    );
};

export default HomePage;